app/controllers/articles_controller.rb

	def index
      @articles = Article.all
---
SELECT `articles`.* FROM `articles`

	def show
      @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1

    def edit
      @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1

    def create
      @article = Article.new(article_params)
      if @article.save
---
INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('wqdw', 'deqwdwq', '2017-10-04 06:52:27', '2017-10-04 06:52:27')

    def update
      @article = Article.find(params[:id])
       if @article.update(article_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
UPDATE `articles` SET `title` = 'wqdwt', `updated_at` = '2017-10-04 07:28:16' WHERE `articles`.`id` = 2

    def destroy
      @article = Article.find(params[:id])
      @article.destroy
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 1