app/controllers/comments_controller.rb

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 5 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `article_id`, `created_at`, `updated_at`) VALUES ('xsada', 'dasddwq', 5, '2017-10-04 07:58:42', '2017-10-04 07:58:42')
---
def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 5 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`article_id` = 5 AND `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
 def destroy
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy